package Repetition_1;

/**
 * Вывести на экран слово “​JAVA”​, в столбик, чтобы оно повторилось 10 раз,
 * используя цикл на ваше усмотрение (​for​ или w​hile​).
 */
public class Task_3 {
    public static void main(String[] args) {
 /** Решение через цикл for
  *  for(int i = 0; i < 10; i++){
            System.out.println("Java");
  */
        /**
         * Решение через цикл while
         */
        int counter = 0;
        while (counter < 10){
            System.out.println("Java");
            counter++;

        }
    }
}
